## Plan Result (688: zr_prod_acr - TerraformPlanApply)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.zr_acr[&#34;hmctsprod-jenkins-cftptl-intsvc-mi-contributor&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.zr_acr["hmctsprod-jenkins-cftptl-intsvc-mi-contributor"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg/providers/Microsoft.ContainerRegistry/registries/hmctsprod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 688: zr_prod_acr - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Target":"688: zr_prod_acr - TerraformPlanApply","Vars":{}} -->